TITLE ЛР_3
;------------------------------------------------------------------------------
;ЛР  №3
;------------------------------------------------------------------------------
; Архітектура комп'ютера.
; Завдання:     Основи розробки і налагодження
; ВУЗ:          КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:         1
; Група:        ІТ-01
;------------------------------------------------------------------------------
; Автор:        Гончаренко, Доброхотова, Нікітченко
; Дата:         11/03/2021
;----------------------------I.ЗАГОЛОВОК ПРОГРАМИ------------------------------
IDEAL           ; Директива - тип Асемблера tasm
MODEL SMALL     ; Директива - тип моделі пам'яті
STACK 512       ; Директива - розмір стеку в байтах
;----------------------------II.МАКРОСИ---------------------------------------- 	 	
; Складний макрос для ініціалізації 
MACRO M_Init	;Початок макросу 
mov	ax, @data	; ax <- @data
mov	ds, ax	    ; ds <- ax
mov	es, ax	    ; es <- ax 
ENDM M_Init

;--------------------III.ПОЧАТОК СЕГМЕНТУ ДАНИХ--------------
DATASEG
;Оголошення двовимірного експериментального масиву 16х16 
array2Db db 7, 8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,'H' ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,'D' ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,'S' ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,'D' ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,'K' ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,'O' ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,'N' ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,'N' ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,'O' ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,7

;-----------------------VI. ПОЧАТОК СЕГМЕНТУ КОДУ-------------------------------
CODESEG

Start:	
M_Init
    mov ah, [array2Db] ; Запис масиву у старші біти регістру ah
    mov bx, 00h
    mov [bx], ah

end Start